[{"index": "0", "seq1": "I stuck a pin through a carrot. When I pulled the pin out, it had a hole.", "seq2": "The carrot had a hole.", "label": 0}, {"index": "1", "seq1": "John couldn't see the stage with Billy in front of him because he is so short.", "seq2": "John is so short.", "label": 0}, {"index": "2", "seq1": "The police arrested all of the gang members. They were trying to stop the drug trade in the neighborhood.", "seq2": "The police were trying to stop the drug trade in the neighborhood.", "label": 0}, {"index": "3", "seq1": "Steve follows Fred's example in everything. He influences him hugely.", "seq2": "Steve influences him hugely.", "label": 1}, {"index": "4", "seq1": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her, undressing and climbing back into her berth.", "seq2": "mother was careful not to disturb her, undressing and climbing back into her berth.", "label": 1}, {"index": "5", "seq1": "George got free tickets to the play, but he gave them to Eric, because he was particularly eager to see it.", "seq2": "George was particularly eager to see it.", "label": 1}, {"index": "6", "seq1": "John was jogging through the park when he saw a man juggling watermelons. He was very impressive.", "seq2": "John was very impressive.", "label": 1}, {"index": "7", "seq1": "I couldn't put the pot on the shelf because it was too tall.", "seq2": "The pot was too tall.", "label": 0}, {"index": "8", "seq1": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply not enough of them.", "seq2": "There were simply not enough copies of the newsletter.", "label": 0}, {"index": "9", "seq1": "At the Loebner competition the judges couldn't figure out which respondents were the chatbots because they were so advanced.", "seq2": "The judges were so advanced.", "label": 1}, {"index": "10", "seq1": "I took the water bottle out of the backpack so that it would be lighter.", "seq2": "I took the water bottle out of the backpack so that the backpack would be lighter.", "label": 0}, {"index": "11", "seq1": "The table won't fit through the doorway because it is too narrow.", "seq2": "The table is too narrow.", "label": 1}, {"index": "12", "seq1": "I took the water bottle out of the backpack so that it would be handy.", "seq2": "I took the water bottle out of the backpack so that the backpack would be handy.", "label": 1}, {"index": "13", "seq1": "The firemen arrived after the police because they were coming from so far away.", "seq2": "The police were coming from so far away.", "label": 1}, {"index": "14", "seq1": "Always before, Larry had helped Dad with his work. But he could not help him now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "seq2": "Dad could not help him now.", "label": 1}, {"index": "15", "seq1": "I poured water from the bottle into the cup until it was empty.", "seq2": "The cup was empty.", "label": 1}, {"index": "16", "seq1": "I put the cake away in the refrigerator. It has a lot of butter in it.", "seq2": "The cake has a lot of butter in it.", "label": 0}, {"index": "17", "seq1": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send him to steal nuclear material from an army vault.", "seq2": "Lionel plans to use it on Geoffrey and send Lionel to steal nuclear material from an army vault.", "label": 1}, {"index": "18", "seq1": "The foxes are getting in at night and attacking the chickens. They have gotten very bold.", "seq2": "The foxes have gotten very bold.", "label": 0}, {"index": "19", "seq1": "Sam pulled up a chair to the piano, but it was broken, so he had to stand instead.", "seq2": "The piano was broken, so he had to stand instead.", "label": 1}, {"index": "20", "seq1": "Jane knocked on Susan's door but she did not get an answer.", "seq2": "Susan did not get an answer.", "label": 1}, {"index": "21", "seq1": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, he would have won.", "seq2": "Adam would have won.", "label": 1}, {"index": "22", "seq1": "I put the butterfly wing on the table and it broke.", "seq2": "The table broke.", "label": 1}, {"index": "23", "seq1": "Paul tried to call George on the phone, but he wasn't successful.", "seq2": "Paul wasn't successful.", "label": 0}, {"index": "24", "seq1": "Look! There is a shark swimming right below that duck! It had better get away to safety fast!", "seq2": "The shark had better get away to safety fast!", "label": 1}, {"index": "25", "seq1": "The trophy doesn't fit into the brown suitcase because it is too large.", "seq2": "The suitcase is too large.", "label": 1}, {"index": "26", "seq1": "Joe's uncle can still beat him at tennis, even though he is 30 years older.", "seq2": "Joe is 30 years older.", "label": 1}, {"index": "27", "seq1": "The large ball crashed right through the table because it was made of steel.", "seq2": "The large ball was made of steel.", "label": 0}, {"index": "28", "seq1": "Sam broke both his ankles and he's walking with crutches. But a month or so from now they should be better.", "seq2": "The crutches should be better.", "label": 1}, {"index": "29", "seq1": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack them in his barn where they would dry. Later, he and Tatyana would shell them and cook them for their Sunday dinners.", "seq2": "His friend Henry let him stack Grant and his family in his barn where they would dry.", "label": 1}, {"index": "30", "seq1": "Jane knocked on the door, and Susan answered it. She invited her to come out.", "seq2": "Jane invited her to come out.", "label": 0}, {"index": "31", "seq1": "Dan had to stop Bill from toying with the injured bird. He is very cruel.", "seq2": "Bill is very cruel.", "label": 0}, {"index": "32", "seq1": "Tom said \"Check\" to Ralph as he took his bishop.", "seq2": "Tom said \"Check\" to Ralph as he took Ralph's bishop.", "label": 0}, {"index": "33", "seq1": "I sallied out for a bit of food, more to pass the time than because I wanted it.", "seq2": "I sallied out for a bit of food, more to pass the time than because I wanted food.", "label": 0}, {"index": "34", "seq1": "Joe paid the detective after he received the final report on the case.", "seq2": "Joe received the final report on the case.", "label": 0}, {"index": "35", "seq1": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply too many of them.", "seq2": "There were simply too many copies of the newsletter.", "label": 1}, {"index": "36", "seq1": "Joe has sold his house and bought a new one a few miles away. He will be moving into it on Thursday.", "seq2": "He will be moving into The new house on Thursday.", "label": 0}, {"index": "37", "seq1": "Always before, Larry had helped Dad with his work. But he could not help him now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "seq2": "He could not help Dad now.", "label": 0}, {"index": "38", "seq1": "The table was piled high with food, and on the floor beside it there were crocks, baskets, and a five-quart pail of milk.", "seq2": "Beside the table there were crocks, baskets, and a five-quart pail of milk.", "label": 0}, {"index": "39", "seq1": "Jim comforted Kevin because he was so upset.", "seq2": "Kevin was so upset.", "label": 0}, {"index": "40", "seq1": "Jackson was greatly influenced by Arnold, though he lived two centuries earlier.", "seq2": "Arnold lived two centuries earlier.", "label": 0}, {"index": "41", "seq1": "There is a pillar between me and the stage, and I can't see around it.", "seq2": "I can't see around the stage.", "label": 1}, {"index": "42", "seq1": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for deer on the river banks.", "seq2": "Prehistoric humans hunted for deer on the river banks.", "label": 0}, {"index": "43", "seq1": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because they are snobs.", "seq2": "Amy's parents are snobs.", "label": 0}, {"index": "44", "seq1": "Bill passed the half-empty plate to John because he was hungry.", "seq2": "John was hungry.", "label": 0}, {"index": "45", "seq1": "Sara borrowed the book from the library because she needs it for an article she is working on. She writes it when she gets home from work.", "seq2": "She writes the book when she gets home from work.", "label": 1}, {"index": "46", "seq1": "John promised Bill to leave, so an hour later he left.", "seq2": "Bill left.", "label": 1}, {"index": "47", "seq1": "Sara borrowed the book from the library because she needs it for an article she is working on. She reads it when she gets home from work.", "seq2": "She reads the article when she gets home from work.", "label": 1}, {"index": "48", "seq1": "Mark heard Steve's feet going down the ladder. The door of the shop closed after him. He ran to look out the window.", "seq2": "The door of the shop closed after Steve.", "label": 0}, {"index": "49", "seq1": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, he was twelve years old.", "seq2": "When Fred first saw my father, My father was twelve years old.", "label": 1}, {"index": "50", "seq1": "Tatyana knew that Grandma always enjoyed serving an abundance of food to her guests. Now Tatyana watched as Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled her to the table, lifting her shawl from her shoulders, seating her in the place of honor, and saying simply: \"There's plenty.\"", "seq2": "Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled Grandma to the table.", "label": 1}, {"index": "51", "seq1": "Fred watched TV while George went out to buy groceries. After an hour he got back.", "seq2": "George got back.", "label": 0}, {"index": "52", "seq1": "Lily spoke to Donna, breaking her concentration.", "seq2": "Lily spoke to Donna, breaking Donna's concentration.", "label": 0}, {"index": "53", "seq1": "Although they ran at about the same speed, Sue beat Sally because she had such a bad start.", "seq2": "Sue had such a bad start.", "label": 1}, {"index": "54", "seq1": "Madonna fired her trainer because she couldn't stand her boyfriend.", "seq2": "She couldn't stand Madonna's boyfriend.", "label": 1}, {"index": "55", "seq1": "I can't cut that tree down with that axe; it is too small.", "seq2": "The axe is too small.", "label": 0}, {"index": "56", "seq1": "Madonna fired her trainer because she slept with her boyfriend.", "seq2": "She slept with Madonna's boyfriend.", "label": 0}, {"index": "57", "seq1": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know why he was, but he looked very unhappy.", "seq2": "I don't know why the guy in uniform was, but he looked very unhappy.", "label": 1}, {"index": "58", "seq1": "Alice tried frantically to stop her daughter from chatting at the party, leaving us to wonder why she was behaving so strangely.", "seq2": "Alice's daughter was behaving so strangely.", "label": 1}, {"index": "59", "seq1": "Jane knocked on Susan's door but she did not answer.", "seq2": "Jane did not answer.", "label": 1}, {"index": "60", "seq1": "The politicians far away in Washington could not know the settlers so they must make rules to regulate them.", "seq2": "The politicians must make rules to regulate them.", "label": 0}, {"index": "61", "seq1": "A number of times Henry had been present at interviews which his father had had with noted detectives who desired his aid in solving perplexing mysteries, and those occasions stood out as red-letter days for him.", "seq2": "Those occasions stood out as red-letter days for Henry.", "label": 0}, {"index": "62", "seq1": "Sam pulled up a chair to the piano, but it was broken, so he had to stand instead.", "seq2": "The chair was broken, so he had to stand instead.", "label": 0}, {"index": "63", "seq1": "Since it was raining, I carried the newspaper over my backpack to keep it dry.", "seq2": "I carried the newspaper over my backpack to keep the backpack dry.", "label": 0}, {"index": "64", "seq1": "The politicians far away in Washington could not know the settlers so they must make rules to regulate them.", "seq2": "They must make rules to regular the politicians.", "label": 1}, {"index": "65", "seq1": "Anna did a lot better than her good friend Lucy on the test because she had studied so hard.", "seq2": "Anna had studied so hard.", "label": 0}, {"index": "66", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "Mr. Singer heard him calling for the captain", "label": 1}, {"index": "67", "seq1": "Fred is the only man still alive who remembers my great-grandfather. He was a remarkable man.", "seq2": "My great-grandfather was a remarkable man.", "label": 0}, {"index": "68", "seq1": "I couldn't put the pot on the shelf because it was too high.", "seq2": "The shelf was too high.", "label": 0}, {"index": "69", "seq1": "No one joins Facebook to be sad and lonely. But a new study from the University of Wisconsin psychologist George Lincoln argues that that's exactly how it makes us feel.", "seq2": "That's exactly how the study makes us feel.", "label": 1}, {"index": "70", "seq1": "Bob paid for Charlie's college education. He is very generous.", "seq2": "Bob is very generous.", "label": 0}, {"index": "71", "seq1": "John promised Bill to leave, so an hour later he left.", "seq2": "John left.", "label": 0}, {"index": "72", "seq1": "Frank was upset with Tom because the toaster he had sold him didn't work.", "seq2": "The toaster Frank had sold him didn't work.", "label": 1}, {"index": "73", "seq1": "Equally swoon-worthy is C.K. Dexter Haven, a pallid young dandy holding a jade-handled walking stick, with a poodle asleep at his feet.", "seq2": "Equally swoon-worthy is C.K. Dexter Haven, a pallid young dandy holding a jade-handled walking stick, with a poodle asleep at Haven's feet.", "label": 0}, {"index": "74", "seq1": "Joe has sold his house and bought a new one a few miles away. He will be moving out of it on Thursday.", "seq2": "He will be moving out of The old house on Thursday.", "label": 0}, {"index": "75", "seq1": "Mark heard Steve's feet going down the ladder. The door of the shop closed after him. He ran to look out the window.", "seq2": "The door of the shop closed after Mark.", "label": 1}, {"index": "76", "seq1": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave it too small.", "seq2": "Even one thread uncut will leave the right size too small.", "label": 1}, {"index": "77", "seq1": "Billy cried because Toby wouldn't accept his toy.", "seq2": "Billy cried because Toby wouldn't accept Toby's toy.", "label": 1}, {"index": "78", "seq1": "As Ollie carried Tommy up the long winding steps, his legs dangled.", "seq2": "Ollie's legs dangled.", "label": 1}, {"index": "79", "seq1": "Sam pulled up a chair to the piano, but it was broken, so he had to sing instead.", "seq2": "The chair was broken, so he had to sing instead.", "label": 1}, {"index": "80", "seq1": "The fish ate the worm. It was hungry.", "seq2": "The worm was hungry.", "label": 1}, {"index": "81", "seq1": "The journalists interviewed the stars of the new movie. They were very cooperative, so the interview lasted for a long time.", "seq2": "The journalists were very cooperative, so the interview lasted for a long time.", "label": 1}, {"index": "82", "seq1": "The trophy doesn't fit into the brown suitcase because it is too small.", "seq2": "The trophy is too small.", "label": 1}, {"index": "83", "seq1": "Thomson visited Cooper's grave in 1765. At that date he had been travelling for five years.", "seq2": "Cooper had been travelling for five years.", "label": 1}, {"index": "84", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "She put the album on a chair without even opening the living room.", "label": 1}, {"index": "85", "seq1": "Bill passed the half-empty plate to John because he was full.", "seq2": "Bill was full.", "label": 0}, {"index": "86", "seq1": "Bill passed the half-empty plate to John because he was full.", "seq2": "John was full.", "label": 1}, {"index": "87", "seq1": "The foxes are getting in at night and attacking the chickens. I shall have to kill them.", "seq2": "I shall have to kill The foxes.", "label": 0}, {"index": "88", "seq1": "Joe's uncle can still beat him at tennis, even though he is 30 years younger.", "seq2": "Joe is 30 years younger.", "label": 0}, {"index": "89", "seq1": "Emma did not pass the ball to Janie although she was open.", "seq2": "She saw that Janie was open.", "label": 0}, {"index": "90", "seq1": "Bill passed the gameboy to John because his turn was over.", "seq2": "Bill's turn was over.", "label": 0}, {"index": "91", "seq1": "Ann asked Mary what time the library closes, because she had forgotten.", "seq2": "Ann had forgotten.", "label": 0}, {"index": "92", "seq1": "Pam's parents came home and found her having sex with her boyfriend, Paul. They were furious about it.", "seq2": "Pam's parents were furious about it.", "label": 0}, {"index": "93", "seq1": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked it down.", "seq2": "This afternoon the tide knocked The flag down.", "label": 1}, {"index": "94", "seq1": "The man couldn't lift his son because he was so weak.", "seq2": "The man was so weak.", "label": 0}, {"index": "95", "seq1": "The customer walked into the bank and stabbed one of the tellers. He was immediately taken to the hospital.", "seq2": "The customer was immediately taken to the hospital.", "label": 1}, {"index": "96", "seq1": "Since Chester was dependent on Uncle Vernon, he couldn't very well marry without his approval", "seq2": "He couldn't very well marry without Chester's approval", "label": 1}, {"index": "97", "seq1": "Mama came over and sat down beside Alice. Gently she stroked her hair and let the child weep.", "seq2": "Mama stroked her hair and let the child weep.", "label": 0}, {"index": "98", "seq1": "Emma did not pass the ball to Janie although she saw that she was open.", "seq2": "Emma saw that she was open.", "label": 0}, {"index": "99", "seq1": "Mark became absorbed in Blaze, the white horse. He was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so he took upon himself the feeding and care of the animal.", "seq2": "Mark was afraid the stable boys at the Burlington Stables struck at him and bullied him.", "label": 0}, {"index": "100", "seq1": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid she lay in the bunk below! Her eyes were closed, but Tatyana doubted if she slept.", "seq2": "Tatyana doubted if her mother slept.", "label": 0}, {"index": "101", "seq1": "James asked Robert for a favor but he was refused.", "seq2": "Robert was refused.", "label": 1}, {"index": "102", "seq1": "I can't cut that tree down with that axe; it is too thick.", "seq2": "The axe is too thick.", "label": 1}, {"index": "103", "seq1": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. He was very ill.", "seq2": "Bob was very ill.", "label": 0}, {"index": "104", "seq1": "Emma did not pass the ball to Janie although she saw that she was open.", "seq2": "Janie saw that she was open.", "label": 1}, {"index": "105", "seq1": "Tom gave Ralph a lift to school so he wouldn't have to drive alone.", "seq2": "Tom wouldn't have to drive alone.", "label": 0}, {"index": "106", "seq1": "Sam's drawing was hung just above Tina's and it did look much better with another one below it.", "seq2": "Sam's drawing did look much better with another one below it.", "label": 0}, {"index": "107", "seq1": "Although they ran at about the same speed, Sue beat Sally because she had such a good start.", "seq2": "Sue had such a good start.", "label": 0}, {"index": "108", "seq1": "Grace was happy to trade me her sweater for my jacket. She thinks it looks dowdy on her.", "seq2": "The sweater looks dowdy on her.", "label": 0}, {"index": "109", "seq1": "Bob paid for Charlie's college education. He is very grateful.", "seq2": "Charlie is very grateful.", "label": 0}, {"index": "110", "seq1": "Grace was happy to trade me her sweater for my jacket. She thinks it looks great on her.", "seq2": "The sweater looks great on her.", "label": 1}, {"index": "111", "seq1": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. He needed to get him to finish his work, because his work was beautiful.", "seq2": "Mr. Schmidt's work was beautiful.", "label": 0}, {"index": "112", "seq1": "The man lifted the boy onto his shoulders.", "seq2": "The man lifted the boy onto the man's shoulders.", "label": 0}, {"index": "113", "seq1": "Fred and Alice had very warm down coats, but they were not prepared for the cold in Alaska.", "seq2": "coats were not prepared for the cold in Alaska.", "label": 1}, {"index": "114", "seq1": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, they were defeated within weeks.", "seq2": "Yakutsk was defeated within weeks.", "label": 1}, {"index": "115", "seq1": "Jackson was greatly influenced by Arnold, though he lived two centuries earlier.", "seq2": "Jackson lived two centuries earlier.", "label": 1}, {"index": "116", "seq1": "The path to the lake was blocked, so we couldn't use it.", "seq2": "We couldn't use the lake.", "label": 1}, {"index": "117", "seq1": "Sara borrowed the book from the library because she needs it for an article she is working on. She reads it when she gets home from work.", "seq2": "She reads the book when she gets home from work.", "label": 0}, {"index": "118", "seq1": "The customer walked into the bank and stabbed one of the tellers. He was immediately taken to the police station.", "seq2": "The teller was immediately taken to the police station.", "label": 1}, {"index": "119", "seq1": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, he would be here by this time.", "seq2": "Bob would be here by this time.", "label": 0}, {"index": "120", "seq1": "What about the time you cut up tulip bulbs in the hamburgers because you thought they were onions?", "seq2": "You thought tulip bulbs were onions?", "label": 0}, {"index": "121", "seq1": "This book introduced Shakespeare to Ovid; it was a major influence on his writing.", "seq2": "It was a major influence on Shakespeare's writing.", "label": 0}, {"index": "122", "seq1": "Thomson visited Cooper's grave in 1765. At that date he had been dead for five years.", "seq2": "Cooper had been dead for five years.", "label": 0}, {"index": "123", "seq1": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned it on.", "seq2": "He changed his mind and turned the TV on.", "label": 1}, {"index": "124", "seq1": "Paul tried to call George on the phone, but he wasn't available.", "seq2": "George wasn't available.", "label": 0}, {"index": "125", "seq1": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her, undressing and climbing back into her berth.", "seq2": "Tatyana was careful not to disturb her, undressing and climbing back into her berth.", "label": 0}, {"index": "126", "seq1": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "seq2": "Anyone who knew that he was 19 years old could take his claim away from the government official.", "label": 1}, {"index": "127", "seq1": "Fred is the only man still alive who remembers my great-grandfather. He is a remarkable man.", "seq2": "My great-grandfather is a remarkable man.", "label": 1}, {"index": "128", "seq1": "I put the cake away in the refrigerator. It has a lot of leftovers in it.", "seq2": "The cake has a lot of leftovers in it.", "label": 1}, {"index": "129", "seq1": "Jim signaled the barman and gestured toward his bathroom key.", "seq2": "Jim signaled the barman and gestured toward The barman's bathroom key.", "label": 0}, {"index": "130", "seq1": "Steve follows Fred's example in everything. He influences him hugely.", "seq2": "Fred influences him hugely.", "label": 0}, {"index": "131", "seq1": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her , undressing and climbing back into her berth.", "seq2": "She was careful not to disturb her mother , undressing and climbing back into her berth.", "label": 0}, {"index": "132", "seq1": "Jane gave Joan candy because she wasn't hungry.", "seq2": "Jane wasn't hungry.", "label": 0}, {"index": "133", "seq1": "When Tommy dropped his ice cream, Timmy giggled, so father gave him a stern look.", "seq2": "Father gave Tommy a stern look.", "label": 1}, {"index": "134", "seq1": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because it got full of ink.", "seq2": "The coffee got full of ink.", "label": 0}, {"index": "135", "seq1": "The man couldn't lift his son because he was so weak.", "seq2": "The son was so weak.", "label": 1}, {"index": "136", "seq1": "Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like golfers.", "seq2": "The shepherds ended up looking more like golfers.", "label": 0}, {"index": "137", "seq1": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because it got full of ink.", "seq2": "The pen got full of ink.", "label": 1}, {"index": "138", "seq1": "John was jogging through the park when he saw a man juggling watermelons. He was very impressed.", "seq2": "John was very impressed.", "label": 0}, {"index": "139", "seq1": "Fred covered his eyes with his hands, because the wind was blowing sand around. He lowered them when the wind stopped.", "seq2": "He lowered his eyes when the wind stopped.", "label": 1}, {"index": "140", "seq1": "The delivery truck zoomed by the school bus because it was going so fast.", "seq2": "The school bus was going so fast.", "label": 1}, {"index": "141", "seq1": "During a game of tag, Ethan chased Luke because he was \"it\".", "seq2": "Luke was \"it\".", "label": 1}, {"index": "142", "seq1": "There is a gap in the wall. You can see the garden behind it.", "seq2": "You can see the garden through the wall.", "label": 0}, {"index": "143", "seq1": "I took the water bottle out of the backpack so that it would be lighter.", "seq2": "I took the water bottle out of the backpack so that the water bottle would be lighter.", "label": 1}, {"index": "144", "seq1": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was out.", "seq2": "The sun was out.", "label": 0}, {"index": "145", "seq1": "Jim yelled at Kevin because he was so upset.", "seq2": "Jim was so upset.", "label": 0}, {"index": "146", "seq1": "Even before they reached town, they could hear a sound like corn popping. Dora asked what it was, and Dad said it was firecrackers.", "seq2": "Dora asked what the sound was.", "label": 0}, {"index": "147", "seq1": "Bill passed the gameboy to John because his turn was next.", "seq2": "Bill's turn was next.", "label": 1}, {"index": "148", "seq1": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned it on.", "seq2": "He changed his mind and turned the dishwasher on.", "label": 0}, {"index": "149", "seq1": "As Ollie carried Tommy up the long winding steps, his legs ached.", "seq2": "Tommy's legs ached.", "label": 1}, {"index": "150", "seq1": "The foxes are getting in at night and attacking the chickens. I shall have to kill them.", "seq2": "I shall have to kill The chickens.", "label": 1}, {"index": "151", "seq1": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford them.", "seq2": "It was bad enough that the faces had to be denied so many things because he couldn't afford them.", "label": 1}, {"index": "152", "seq1": "The sack of potatoes had been placed above the bag of flour, so it had to be moved first.", "seq2": "The bag of flour had to be moved first.", "label": 1}, {"index": "153", "seq1": "The dog chased the cat, which ran up a tree. It waited at the top.", "seq2": "The dog waited at the top.", "label": 1}, {"index": "154", "seq1": "Steve follows Fred's example in everything. He admires him hugely.", "seq2": "Fred admires him hugely.", "label": 1}, {"index": "155", "seq1": "The woman held the girl against her chest.", "seq2": "The woman held the girl against the woman's chest.", "label": 0}, {"index": "156", "seq1": "The dog chased the cat, which ran up a tree. It waited at the bottom.", "seq2": "The dog waited at the bottom.", "label": 0}, {"index": "157", "seq1": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. He was very concerned.", "seq2": "Carl was very concerned.", "label": 0}, {"index": "158", "seq1": "Sam broke both his ankles and he's walking with crutches. But a month or so from now they should be unnecessary.", "seq2": "The crutches should be unnecessary.", "label": 0}, {"index": "159", "seq1": "I stuck a pin through a carrot. When I pulled the pin out, it left a hole.", "seq2": "The carrot left a hole.", "label": 1}, {"index": "160", "seq1": "Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like dogs.", "seq2": "The sheep ended up looking more like dogs.", "label": 0}, {"index": "161", "seq1": "In the middle of the outdoor concert, the rain started falling, and it continued until 10.", "seq2": "The concert continued until 10.", "label": 1}, {"index": "162", "seq1": "The firemen arrived before the police because they were coming from so far away.", "seq2": "The firemen were coming from so far away.", "label": 1}, {"index": "163", "seq1": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get it in.", "seq2": "I couldn't get the key in.", "label": 0}, {"index": "164", "seq1": "Of one thing Mark was sure. Harry knew much less than he did.", "seq2": "Harry knew much less than Mark did.", "label": 0}, {"index": "165", "seq1": "The Dakota prairie lay so warm and bright under the shining sun that it did not seem possible that it had ever been swept by the winds and snows of that hard winter.", "seq2": "It did not seem possible that the prairie had ever been swept by the winds and snows of that hard winter.", "label": 0}, {"index": "166", "seq1": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because it was hot.", "seq2": "The dog was hot.", "label": 0}, {"index": "167", "seq1": "Frank felt vindicated when his longtime rival Bill revealed that he was the winner of the competition.", "seq2": "Frank was the winner of the competition.", "label": 0}, {"index": "168", "seq1": "Joan made sure to thank Susan for all the help she had given.", "seq2": "Joan made sure to thank Susan for all the help Susan had given.", "label": 0}, {"index": "169", "seq1": "They broadcast an announcement, but a subway came into the station and I couldn't hear over it.", "seq2": "I couldn't hear the announcement.", "label": 1}, {"index": "170", "seq1": "John was doing research in the library when he heard a man humming and whistling. He was very annoyed.", "seq2": "John was very annoyed.", "label": 0}, {"index": "171", "seq1": "Mary took out her flute and played one of her favorite pieces. She has loved it since she was a child.", "seq2": "She has loved the piece since she was a child.", "label": 0}, {"index": "172", "seq1": "I'm sure that my map will show this building; it is very good.", "seq2": "The map is very good.", "label": 0}, {"index": "173", "seq1": "Carol believed that Rebecca regretted that she had stolen the watch.", "seq2": "Carol believed that Rebecca regretted that Rebecca had stolen the watch.", "label": 0}, {"index": "174", "seq1": "The table won't fit through the doorway because it is too narrow.", "seq2": "The doorway is too narrow.", "label": 0}, {"index": "175", "seq1": "If the con artist has succeeded in fooling Sam, he would have lost a lot of money.", "seq2": "The con artist would have lost a lot of money.", "label": 1}, {"index": "176", "seq1": "Sam pulled up a chair to the piano, but it was broken, so he had to sing instead.", "seq2": "The piano was broken, so he had to sing instead.", "label": 0}, {"index": "177", "seq1": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, he was twelve months old.", "seq2": "When Fred first saw my father, Fred was twelve months old.", "label": 1}, {"index": "178", "seq1": "Anna did a lot better than her good friend Lucy on the test because she had studied so hard.", "seq2": "Lucy had studied so hard.", "label": 1}, {"index": "179", "seq1": "Jane knocked on the door, and Susan answered it. She invited her to come out.", "seq2": "Susan invited her to come out.", "label": 1}, {"index": "180", "seq1": "The path to the lake was blocked, so we couldn't reach it.", "seq2": "We couldn't reach the lake.", "label": 0}, {"index": "181", "seq1": "Grace was happy to trade me her sweater for my jacket. She thinks it looks dowdy on her.", "seq2": "The jacket looks dowdy on her.", "label": 1}, {"index": "182", "seq1": "Kirilov ceded the presidency to Shatov because he was more popular.", "seq2": "Kirilov was more popular.", "label": 1}, {"index": "183", "seq1": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but they came out looking more like telephone poles.", "seq2": "The lemon trees came out looking more like telephone poles.", "label": 0}, {"index": "184", "seq1": "Pete envies Martin because he is very successful.", "seq2": "Martin is very successful.", "label": 0}, {"index": "185", "seq1": "Since it was raining, I carried the newspaper in my backpack to keep it dry.", "seq2": "I carried the newspaper in my backpack to keep the newspaper dry.", "label": 0}, {"index": "186", "seq1": "Pam's parents came home and found her having sex with her boyfriend, Paul. They were furious about it.", "seq2": "Pam and Paul were furious about it.", "label": 1}, {"index": "187", "seq1": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with it there all the time.", "seq2": "He had to be the life and soul of a dinner party, with the dinner party there all the time.", "label": 1}, {"index": "188", "seq1": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get it removed.", "seq2": "Now I have to get The tree removed.", "label": 0}, {"index": "189", "seq1": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned it off.", "seq2": "He changed his mind and turned the TV off.", "label": 0}, {"index": "190", "seq1": "In the middle of the outdoor concert, the rain started falling, and it continued until 10.", "seq2": "The rain continued until 10.", "label": 0}, {"index": "191", "seq1": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave it too small.", "seq2": "Even one thread uncut will leave one thread too small.", "label": 1}, {"index": "192", "seq1": "Sam took French classes from Adam, because he was known to speak it fluently.", "seq2": "Adam was known to speak it fluently.", "label": 0}, {"index": "193", "seq1": "Sid explained his theory to Mark but he couldn't convince him.", "seq2": "Sid couldn't convince him.", "label": 0}, {"index": "194", "seq1": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make more of them.", "seq2": "We should make more of the oatmeal cookies.", "label": 0}, {"index": "195", "seq1": "The sack of potatoes had been placed below the bag of flour, so it had to be moved first.", "seq2": "The bag of flour had to be moved first.", "label": 0}, {"index": "196", "seq1": "As Ollie carried Tommy up the long winding steps, his legs dangled.", "seq2": "Tommy's legs dangled.", "label": 0}, {"index": "197", "seq1": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties he faced in his research.", "seq2": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Goodman faced in his research.", "label": 0}, {"index": "198", "seq1": "Mark became absorbed in Blaze, the white horse. He was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so he took upon himself the feeding and care of the animal.", "seq2": "Blaze took upon himself the feeding and care of the animal.", "label": 1}, {"index": "199", "seq1": "Joe's uncle can still beat him at tennis, even though he is 30 years older.", "seq2": "Joe's uncle is 30 years older.", "label": 0}, {"index": "200", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "Mama had to hunt for a button.", "label": 1}, {"index": "201", "seq1": "I poured water from the bottle into the cup until it was full.", "seq2": "The cup was full.", "label": 0}, {"index": "202", "seq1": "During a game of tag, Ethan chased Luke because he was \"it\".", "seq2": "Ethan was \"it\".", "label": 0}, {"index": "203", "seq1": "Jane gave Joan candy because she was hungry.", "seq2": "Joan was hungry.", "label": 0}, {"index": "204", "seq1": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires his financial support.", "seq2": "Edward no longer requires his financial support.", "label": 0}, {"index": "205", "seq1": "When Tommy dropped his ice cream, Timmy giggled, so father gave him a sympathetic look.", "seq2": "Father gave Tommy a sympathetic look.", "label": 0}, {"index": "206", "seq1": "John was doing research in the library when he heard a man humming and whistling. He was very annoyed.", "seq2": "The man was very annoyed.", "label": 1}, {"index": "207", "seq1": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave it too small.", "seq2": "Even one thread uncut will leave the slip too small.", "label": 1}, {"index": "208", "seq1": "Susan knows all about Ann's personal problems because she is nosy.", "seq2": "Ann is nosy.", "label": 1}, {"index": "209", "seq1": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave it too small.", "seq2": "Even one thread uncut will leave the scissors too small.", "label": 1}, {"index": "210", "seq1": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was out.", "seq2": "The cloud was out.", "label": 1}, {"index": "211", "seq1": "The journalists interviewed the stars of the new movie. They were very cooperative, so the interview lasted for a long time.", "seq2": "The stars were very cooperative, so the interview lasted for a long time.", "label": 0}, {"index": "212", "seq1": "The city councilmen refused the demonstrators a permit because they feared violence.", "seq2": "The city councilmen feared violence.", "label": 0}, {"index": "213", "seq1": "Anne gave birth to a daughter last month. She is a very charming woman.", "seq2": "Anne's daughter is a very charming woman.", "label": 1}, {"index": "214", "seq1": "Jackson was greatly influenced by Arnold, though he lived two centuries later.", "seq2": "Jackson lived two centuries later.", "label": 0}, {"index": "215", "seq1": "This book introduced Shakespeare to Ovid; it was a fine selection of his writing.", "seq2": "It was a fine selection of Shakespeare's writing.", "label": 1}, {"index": "216", "seq1": "The father carried the sleeping boy in his bassinet.", "seq2": "The father carried the sleeping boy in the father's bassinet.", "label": 1}, {"index": "217", "seq1": "Dan took the rear seat while Bill claimed the front because his \"Dibs!\" was quicker.", "seq2": "Dan took the rear seat while Bill claimed the front because Dan's \"Dibs!\" was quicker.", "label": 1}, {"index": "218", "seq1": "Pete envies Martin although he is very successful.", "seq2": "Martin is very successful.", "label": 1}, {"index": "219", "seq1": "Of one thing Mark was sure. Harry knew much less than he did.", "seq2": "Harry knew much less than Harry did.", "label": 1}, {"index": "220", "seq1": "Since Chester was dependent on Uncle Vernon, he couldn't very well marry without his approval", "seq2": "Uncle Vernon couldn't very well marry without his approval", "label": 1}, {"index": "221", "seq1": "Thomson visited Cooper's grave in 1765. At that date he had been dead for five years.", "seq2": "Thomson had been dead for five years.", "label": 1}, {"index": "222", "seq1": "Mark told Pete many lies about himself, which Pete included in his book. He should have been more skeptical.", "seq2": "Mark should have been more skeptical.", "label": 1}, {"index": "223", "seq1": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, it was delayed, so it worked out.", "seq2": "The meeting was delayed, so it worked out.", "label": 1}, {"index": "224", "seq1": "The foxes are getting in at night and attacking the chickens. They have gotten very nervous.", "seq2": "The foxes have gotten very nervous.", "label": 1}, {"index": "225", "seq1": "I put the butterfly wing on the table and it broke.", "seq2": "The butterfly wing broke.", "label": 0}, {"index": "226", "seq1": "Fred and Alice had very warm down coats, but they were not prepared for the cold in Alaska.", "seq2": "Fred and Alice were not prepared for the cold in Alaska.", "label": 0}, {"index": "227", "seq1": "Tom gave Ralph a lift to school so he wouldn't have to walk.", "seq2": "Tom wouldn't have to walk.", "label": 1}, {"index": "228", "seq1": "I put the cake away in the refrigerator. It has a lot of leftovers in it.", "seq2": "The refrigerator has a lot of leftovers in it.", "label": 0}, {"index": "229", "seq1": "Sid explained his theory to Mark but he couldn't convince him.", "seq2": "Mark couldn't convince him.", "label": 1}, {"index": "230", "seq1": "I took the water bottle out of the backpack so that it would be handy.", "seq2": "I took the water bottle out of the backpack so that the water bottle would be handy.", "label": 0}, {"index": "231", "seq1": "The fish ate the worm. It was tasty.", "seq2": "The worm was tasty.", "label": 0}, {"index": "232", "seq1": "As Andrea in the crop duster passed over Susan, she could see the landing strip.", "seq2": "Andrea could see the landing strip.", "label": 0}, {"index": "233", "seq1": "As Andrea in the crop duster passed over Susan, she could see the landing strip.", "seq2": "Susan could see the landing strip.", "label": 1}, {"index": "234", "seq1": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send him to steal nuclear material from an army vault.", "seq2": "Lionel plans to use it on Geoffrey and send Geoffrey to steal nuclear material from an army vault.", "label": 0}, {"index": "235", "seq1": "Kirilov ceded the presidency to Shatov because he was more popular.", "seq2": "Shatov was more popular.", "label": 0}, {"index": "236", "seq1": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "seq2": "The government official was less than 21 when he filed for a homestead claim.", "label": 1}, {"index": "237", "seq1": "Mama came over and sat down beside Alice. Gently she stroked her hair and let the child weep.", "seq2": "Alice stroked her hair and let the child weep.", "label": 1}, {"index": "238", "seq1": "Alice looked for her friend Jade in the crowd. Since she always has good luck, Alice spotted her quickly.", "seq2": "Since Jade always has good luck, Alice spotted her quickly.", "label": 1}, {"index": "239", "seq1": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with it there all the time.", "seq2": "He had to be the life and soul of a dinner party, with the body there all the time.", "label": 0}, {"index": "240", "seq1": "The cat was lying by the mouse hole waiting for the mouse, but it was too impatient.", "seq2": "The mouse was too impatient.", "label": 1}, {"index": "241", "seq1": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make more of them.", "seq2": "We should make more of the chocolate chip cookies.", "label": 1}, {"index": "242", "seq1": "Jim signaled the barman and gestured toward his bathroom key.", "seq2": "Jim signaled the barman and gestured toward Jim's bathroom key.", "label": 1}, {"index": "243", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "He heard Mr. Singer calling for the captain.", "label": 0}, {"index": "244", "seq1": "I couldn't put the pot on the shelf because it was too tall.", "seq2": "The shelf was too tall.", "label": 1}, {"index": "245", "seq1": "John was jogging through the park when he saw a man juggling watermelons. He was very impressive.", "seq2": "The juggler was very impressive.", "label": 0}, {"index": "246", "seq1": "The lawyer asked the witness a question, but he was reluctant to answer it.", "seq2": "The witness was reluctant to answer it.", "label": 0}, {"index": "247", "seq1": "Susan knew that Ann's son had been in a car accident, because she told her about it.", "seq2": "Susan told her about it.", "label": 1}, {"index": "248", "seq1": "Since Chester was dependent on Uncle Vernon, he couldn't very well marry without his approval", "seq2": "Chester couldn't very well marry without his approval", "label": 0}, {"index": "249", "seq1": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. They were very much in the majority.", "seq2": "The opponents were very much in the majority.", "label": 0}, {"index": "250", "seq1": "Billy cried because Toby wouldn't share his toy.", "seq2": "Billy cried because Toby wouldn't share Toby's toy.", "label": 0}, {"index": "251", "seq1": "At the Loebner competition the judges couldn't figure out which respondents were the chatbots because they were so stupid.", "seq2": "The judges were so stupid.", "label": 0}, {"index": "252", "seq1": "The large ball crashed right through the table because it was made of steel.", "seq2": "The table was made of steel.", "label": 1}, {"index": "253", "seq1": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack them in his barn where they would dry. Later, he and Tatyana would shell them and cook them for their Sunday dinners.", "seq2": "His friend Henry let him stack the beans in his barn where they would dry.", "label": 0}, {"index": "254", "seq1": "Jane knocked on Susan's door, but there was no answer. She was out.", "seq2": "Jane was out.", "label": 1}, {"index": "255", "seq1": "Jane knocked on the door, and Susan answered it. She invited her to come in.", "seq2": "Jane invited her to come in.", "label": 1}, {"index": "256", "seq1": "The table won't fit through the doorway because it is too wide.", "seq2": "The doorway is too wide.", "label": 1}, {"index": "257", "seq1": "A number of times Henry had been present at interviews which his father had had with noted detectives who desired his aid in solving perplexing mysteries, and those occasions stood out as red-letter days for him.", "seq2": "Those occasions stood out as red-letter days for father.", "label": 1}, {"index": "258", "seq1": "If the con artist has succeeded in fooling Sam, he would have lost a lot of money.", "seq2": "Sam would have lost a lot of money.", "label": 0}, {"index": "259", "seq1": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under his wing, and quickly molds him into a drug runner.", "seq2": "His father's disciple, Antonio, takes Larry under his wing, and quickly molds Larry's father into a drug runner.", "label": 1}, {"index": "260", "seq1": "Frank felt crushed when his longtime rival Bill revealed that he was the winner of the competition.", "seq2": "Frank was the winner of the competition.", "label": 1}, {"index": "261", "seq1": "Fred covered his eyes with his hands, because the wind was blowing sand around. He lowered them when the wind stopped.", "seq2": "He lowered his hands when the wind stopped.", "label": 0}, {"index": "262", "seq1": "The Wainwrights treated Mr. Crowley like a prince until he made his will in their favor; then they treated him like dirt. Folks said he died just to be rid of their everlasting nagging.", "seq2": "Folks said he died just to be ride of the folks' everlasting nagging.", "label": 1}, {"index": "263", "seq1": "The father carried the sleeping boy in his arms.", "seq2": "The father carried the sleeping boy in the boy's arms.", "label": 1}, {"index": "264", "seq1": "There is a gap in the wall. You can see the garden through it.", "seq2": "You can see the garden through the wall.", "label": 1}, {"index": "265", "seq1": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for deer on the river banks.", "seq2": "Archaeologists hunted for deer on the river banks.", "label": 1}, {"index": "266", "seq1": "Susan knew that Ann's son had been in a car accident, so she told her about it.", "seq2": "Susan told her about it.", "label": 0}, {"index": "267", "seq1": "Then Dad figured out how much the man owed the store; to that he added the man's board-bill at the cook-shanty. He subtracted that amount from the man's wages, and made out his check", "seq2": "The man subtracted that amount from the man's wages.", "label": 1}, {"index": "268", "seq1": "The customer walked into the bank and stabbed one of the tellers. He was immediately taken to the hospital.", "seq2": "The teller was immediately taken to the hospital.", "label": 0}, {"index": "269", "seq1": "Kirilov ceded the presidency to Shatov because he was less popular.", "seq2": "Kirilov was less popular.", "label": 0}, {"index": "270", "seq1": "John hired Bill to take care of him.", "seq2": "John hired Bill to take care of Bill.", "label": 1}, {"index": "271", "seq1": "Bill passed the gameboy to John because his turn was next.", "seq2": "John's turn was next.", "label": 0}, {"index": "272", "seq1": "Joe paid the detective after he delivered the final report on the case.", "seq2": "Joe delivered the final report on the case.", "label": 1}, {"index": "273", "seq1": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, he was twelve months old.", "seq2": "When Fred first saw my father, My father was twelve months old.", "label": 0}, {"index": "274", "seq1": "James asked Robert for a favor but he was refused.", "seq2": "James was refused.", "label": 0}, {"index": "275", "seq1": "Lily spoke to Donna, breaking her silence.", "seq2": "Lily spoke to Donna, breaking Lily's silence.", "label": 0}, {"index": "276", "seq1": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, he would have lost.", "seq2": "Bob would have lost.", "label": 1}, {"index": "277", "seq1": "Dan had to stop Bill from toying with the injured bird. He is very cruel.", "seq2": "Dan is very cruel.", "label": 1}, {"index": "278", "seq1": "Ann asked Mary what time the library closes, but she had forgotten.", "seq2": "Mary had forgotten.", "label": 0}, {"index": "279", "seq1": "The sculpture rolled off the shelf because it wasn't anchored.", "seq2": "The sculpture wasn't anchored.", "label": 0}, {"index": "280", "seq1": "Carol believed that Rebecca suspected that she had stolen the watch.", "seq2": "Carol believed that Rebecca suspected that Carol had stolen the watch.", "label": 0}, {"index": "281", "seq1": "Paul tried to call George on the phone, but he wasn't successful.", "seq2": "George wasn't successful.", "label": 1}, {"index": "282", "seq1": "Mary tucked her daughter Anne into bed, so that she could work.", "seq2": "Mary tucked her daughter Anne into bed, so that Mary could work.", "label": 0}, {"index": "283", "seq1": "James asked Robert for a favor but he refused.", "seq2": "Robert refused.", "label": 0}, {"index": "284", "seq1": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because it got full of coffee.", "seq2": "The coffee got full of coffee.", "label": 1}, {"index": "285", "seq1": "The path to the lake was blocked, so we couldn't use it.", "seq2": "We couldn't use the path.", "label": 0}, {"index": "286", "seq1": "Stretching her back, the woman smiled at the girl.", "seq2": "Stretching the girl's back, the woman smiled at the girl.", "label": 1}, {"index": "287", "seq1": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for evidence on the river banks.", "seq2": "Archaeologists hunted for evidence on the river banks.", "label": 0}, {"index": "288", "seq1": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but they came out looking more like light bulbs.", "seq2": "The lemons came out looking more like light bulbs.", "label": 0}, {"index": "289", "seq1": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked it down.", "seq2": "This afternoon the tide knocked The sand castle down.", "label": 0}, {"index": "290", "seq1": "The foxes are getting in at night and attacking the chickens. They have gotten very nervous.", "seq2": "The chickens have gotten very nervous.", "label": 0}, {"index": "291", "seq1": "Tom threw his schoolbag down to Ray after he reached the top of the stairs.", "seq2": "Ray reached the top of the stairs.", "label": 1}, {"index": "292", "seq1": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, they were defeated within weeks.", "seq2": "Kamchatka was defeated within weeks.", "label": 0}, {"index": "293", "seq1": "Madonna fired her trainer because she slept with her boyfriend.", "seq2": "The trainer slept with her boyfriend.", "label": 0}, {"index": "294", "seq1": "Dan had to stop Bill from toying with the injured bird. He is very compassionate.", "seq2": "Dan is very compassionate.", "label": 0}, {"index": "295", "seq1": "I used an old rag to clean the knife, and then I put it in the trash.", "seq2": "I put the rag in the trash.", "label": 0}, {"index": "296", "seq1": "Patting her back, the woman smiled at the girl.", "seq2": "Patting the woman's back, the woman smiled at the girl.", "label": 1}, {"index": "297", "seq1": "The large ball crashed right through the table because it was made of styrofoam.", "seq2": "The table was made of styrofoam.", "label": 0}, {"index": "298", "seq1": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get it out.", "seq2": "I couldn't get the chewing gum out.", "label": 0}, {"index": "299", "seq1": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, he would be gone by this time.", "seq2": "Adam would be gone by this time.", "label": 0}, {"index": "300", "seq1": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very hurt.", "seq2": "Bob is very hurt.", "label": 0}, {"index": "301", "seq1": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "seq2": "Anyone who knew that he was 19 years old could take his claim away from Bernard.", "label": 0}, {"index": "302", "seq1": "Mary took out her flute and played one of her favorite pieces. She has had it since she was a child.", "seq2": "She has had the flute since she was a child.", "label": 0}, {"index": "303", "seq1": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because they are snobs.", "seq2": "Sam and Amy are snobs.", "label": 1}, {"index": "304", "seq1": "This book introduced Shakespeare to Goethe; it was a fine selection of his writing.", "seq2": "It was a fine selection of Shakespeare's writing.", "label": 0}, {"index": "305", "seq1": "The foxes are getting in at night and attacking the chickens. I shall have to guard them.", "seq2": "I shall have to guard The chickens.", "label": 0}, {"index": "306", "seq1": "The donkey wished a wart on its hind leg would disappear, and it did.", "seq2": "The donkey wished a wart on its hind leg would disappear, and wart did.", "label": 0}, {"index": "307", "seq1": "I put the cake away in the refrigerator. It has a lot of butter in it.", "seq2": "The refrigerator has a lot of butter in it.", "label": 1}, {"index": "308", "seq1": "The sack of potatoes had been placed below the bag of flour, so it had to be moved first.", "seq2": "The sack of potatoes had to be moved first.", "label": 1}, {"index": "309", "seq1": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford them.", "seq2": "He couldn't afford the faces.", "label": 1}, {"index": "310", "seq1": "I put the heavy book on the table and it broke.", "seq2": "The heavy book broke.", "label": 1}, {"index": "311", "seq1": "I used an old rag to clean the knife, and then I put it in the drawer.", "seq2": "I put the knife in the drawer.", "label": 0}, {"index": "312", "seq1": "James asked Robert for a favor but he refused.", "seq2": "James refused.", "label": 1}, {"index": "313", "seq1": "Men had the right to keep their sons working for them until they were 21 years of age.", "seq2": "Men had the right to keep their sons working for them until the sons were 21 years of age.", "label": 0}, {"index": "314", "seq1": "The older students were bullying the younger ones, so we rescued them.", "seq2": "We rescued the younger students.", "label": 0}, {"index": "315", "seq1": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the wind knocked it down.", "seq2": "This afternoon the wind knocked The flag down.", "label": 0}, {"index": "316", "seq1": "The sack of potatoes had been placed above the bag of flour, so it had to be moved first.", "seq2": "The sack of potatoes had to be moved first.", "label": 0}, {"index": "317", "seq1": "Anne gave birth to a daughter last month. She is a very charming baby.", "seq2": "Anne's daughter is a very charming baby.", "label": 0}, {"index": "318", "seq1": "Tatyana managed two guitars and a bag, and still could point out the Freemans: \"Isn't it nice that they have come, Mama!\"", "seq2": "Isn't it nice that the Freemans have come, Mama!\"", "label": 0}, {"index": "319", "seq1": "The painting in Mark's living room shows an oak tree. It is to the right of the bookcase.", "seq2": "The painting is to the right of the bookcase.", "label": 0}, {"index": "320", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "The captain and all Mark's crew had best stay in the cabin until the work was over.", "label": 1}, {"index": "321", "seq1": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her, undressing and climbing back into her berth.", "seq2": "She was careful not to disturb her, undressing and climbing back into her mother's berth.", "label": 1}, {"index": "322", "seq1": "Mark heard Steve's feet going down the ladder. The door of the shop closed after him. He ran to look out the window.", "seq2": "Steve ran to look out the window.", "label": 1}, {"index": "323", "seq1": "The storekeepers stayed in town to run their stores and lived in the rooms behind them.", "seq2": "The storekeepers stayed in town to run their stores and lived in the rooms behind the storekeepers.", "label": 1}, {"index": "324", "seq1": "Pete envies Martin because he is very successful.", "seq2": "Pete is very successful.", "label": 1}, {"index": "325", "seq1": "Always before, Larry had helped Dad with his work. But he could not help him now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "seq2": "Dad's boss at the railroad company would not want anyone but him to work in the office.", "label": 0}, {"index": "326", "seq1": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack them in his barn where they would dry. Later, he and Tatyana would shell them and cook them for their Sunday dinners.", "seq2": "Later, he and Tatyana would shell them and cook them for his and Tatyana's Sunday dinners.", "label": 0}, {"index": "327", "seq1": "The journalists interviewed the stars of the new movie. They were very persistent, so the interview lasted for a long time.", "seq2": "The stars were very persistent, so the interview lasted for a long time.", "label": 1}, {"index": "328", "seq1": "Anna did a lot worse than her good friend Lucy on the test because she had studied so hard.", "seq2": "Anna had studied so hard.", "label": 1}, {"index": "329", "seq1": "Dr. Adams informed Kate that she had cancer and presented several options for future treatment.", "seq2": "Kate had cancer and presented several options for future treatment.", "label": 0}, {"index": "330", "seq1": "This book introduced Shakespeare to Ovid; it was a fine selection of his writing.", "seq2": "It was a fine selection of Ovid's writing.", "label": 0}, {"index": "331", "seq1": "During a game of tag, Ethan ran from Luke because he was \"it\".", "seq2": "Luke was \"it\".", "label": 0}, {"index": "332", "seq1": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires his financial support.", "seq2": "Mr. Moncrieff no longer requires his financial support.", "label": 1}, {"index": "333", "seq1": "Alice tried frantically to stop her daughter from chatting at the party, leaving us to wonder why she was behaving so strangely.", "seq2": "Alice was behaving so strangely.", "label": 0}, {"index": "334", "seq1": "The signs over the shops' doors had pictures that indicated what work was done inside. Although more and more people were learning how to read, each artisan still had signs, not wishing to lose a possible patron merely because he happened to be illiterate.", "seq2": "Each artisan still had signs, not wishing to lose a possible patron merely because the patron happened to be illiterate.", "label": 0}, {"index": "335", "seq1": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. They began two years ago.", "seq2": "The fish began two years ago.", "label": 1}, {"index": "336", "seq1": "Dan took the rear seat while Bill claimed the front because his \"Dibs!\" was quicker.", "seq2": "Dan took the rear seat while Bill claimed the front because Bill's \"Dibs!\" was quicker.", "label": 0}, {"index": "337", "seq1": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties he faced in his research.", "seq2": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Xenophanes faced in his research.", "label": 1}, {"index": "338", "seq1": "I stuck a pin through a carrot. When I pulled the pin out, it left a hole.", "seq2": "The pin left a hole.", "label": 0}, {"index": "339", "seq1": "Jackson was greatly influenced by Arnold, though he lived two centuries later.", "seq2": "Arnold lived two centuries later.", "label": 1}, {"index": "340", "seq1": "The politicians far away in Washington could not know the settlers so they must make rules to regulate them.", "seq2": "They must make rules to regular the settlers.", "label": 0}, {"index": "341", "seq1": "As Andrea in the crop duster passed over Susan, she could see the landing gear.", "seq2": "Andrea could see the landing gear.", "label": 1}, {"index": "342", "seq1": "Mama came over and sat down beside Alice. Gently she stroked her hair and let the child weep.", "seq2": "She stroked Alice's hair and let the child weep.", "label": 0}, {"index": "343", "seq1": "Joe has sold his house and bought a new one a few miles away. He will be moving out of it on Thursday.", "seq2": "He will be moving out of The new house on Thursday.", "label": 1}, {"index": "344", "seq1": "Mama came over and sat down beside Alice. Gently she stroked her hair and let the child weep.", "seq2": "She stroked Mama's hair and let the child weep.", "label": 1}, {"index": "345", "seq1": "Joan made sure to thank Susan for all the help she had recieved.", "seq2": "Joan made sure to thank Susan for all the help Joan had recieved.", "label": 0}, {"index": "346", "seq1": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with it there all the time.", "seq2": "He had to be the life and soul of a dinner party, with the table there all the time.", "label": 1}, {"index": "347", "seq1": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under his wing, and quickly molds him into a drug runner.", "seq2": "His father's disciple, Antonio, takes Larry under his wing, and quickly molds Antonio into a drug runner.", "label": 0}, {"index": "348", "seq1": "The older students were bullying the younger ones, so we punished them.", "seq2": "We punished the older students.", "label": 0}, {"index": "349", "seq1": "At the Loebner competition the judges couldn't figure out which respondents were the chatbots because they were so advanced.", "seq2": "The chatbots were so advanced.", "label": 0}, {"index": "350", "seq1": "Pam's parents came home and found her having sex with her boyfriend, Paul. They were embarrassed about it.", "seq2": "Pam and Paul were embarrassed about it.", "label": 0}, {"index": "351", "seq1": "During a game of tag, Ethan ran from Luke because he was \"it\".", "seq2": "Ethan was \"it\".", "label": 1}, {"index": "352", "seq1": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get it out.", "seq2": "I couldn't get the key out.", "label": 1}, {"index": "353", "seq1": "Alice looked for her friend Jade in the crowd. Since she always has good luck, Alice spotted her quickly.", "seq2": "Since Alice always has good luck, Alice spotted her quickly.", "label": 0}, {"index": "354", "seq1": "Since it was raining, I carried the newspaper over my backpack to keep it dry.", "seq2": "I carried the newspaper over my backpack to keep the newspaper dry.", "label": 1}, {"index": "355", "seq1": "Madonna fired her trainer because she couldn't stand her boyfriend.", "seq2": "She couldn't stand the trainer's boyfriend.", "label": 0}, {"index": "356", "seq1": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, they were victorious within weeks.", "seq2": "Kamchatka was victorious within weeks.", "label": 1}, {"index": "357", "seq1": "Frank felt crushed when his longtime rival Bill revealed that he was the winner of the competition.", "seq2": "Bill was the winner of the competition.", "label": 0}, {"index": "358", "seq1": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very ungrateful.", "seq2": "Bob is very ungrateful.", "label": 1}, {"index": "359", "seq1": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires his financial support.", "seq2": "He no longer requires Mr. Moncrieff's financial support.", "label": 0}, {"index": "360", "seq1": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. They appeared two years ago.", "seq2": "The scientists appeared two years ago.", "label": 1}, {"index": "361", "seq1": "The painting in Mark's living room shows an oak tree. It is to the right of a house.", "seq2": "The painting is to the right of a house.", "label": 1}, {"index": "362", "seq1": "The police arrested all of the gang members. They were trying to stop the drug trade in the neighborhood.", "seq2": "The gang members were trying to stop the drug trade in the neighborhood.", "label": 1}, {"index": "363", "seq1": "Mr. Taylor was a man of uncertain temper and his general tendency was to think that David was a poor chump and that whatever step he took in any direction on his own account was just another proof of his innate idiocy.", "seq2": "Any direction on his own account was just another proof of Mr. Taylor's innate idiocy.", "label": 1}, {"index": "364", "seq1": "John was jogging through the park when he saw a man juggling watermelons. He was very impressed.", "seq2": "The juggler was very impressed.", "label": 1}, {"index": "365", "seq1": "The foxes are getting in at night and attacking the chickens. They have gotten very bold.", "seq2": "The chickens have gotten very bold.", "label": 1}, {"index": "366", "seq1": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, he would be here by this time.", "seq2": "Adam would be here by this time.", "label": 1}, {"index": "367", "seq1": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, they were victorious within weeks.", "seq2": "Yakutsk was victorious within weeks.", "label": 0}, {"index": "368", "seq1": "Mary tucked her daughter Anne into bed, so that she could sleep.", "seq2": "Mary tucked her daughter Anne into bed, so that Mary could sleep.", "label": 1}, {"index": "369", "seq1": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. He needed to get him to finish his work, because his work was beautiful.", "seq2": "Mark needed to get him to finish his work, because his work was beautiful.", "label": 0}, {"index": "370", "seq1": "Men had the right to keep their sons working for them until they were 21 years of age.", "seq2": "Men had the right to keep their sons working for them until the men were 21 years of age.", "label": 1}, {"index": "371", "seq1": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make fewer of them.", "seq2": "We should make fewer of the chocolate chip cookies.", "label": 0}, {"index": "372", "seq1": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, he was twelve years old.", "seq2": "When Fred first saw my father, Fred was twelve years old.", "label": 0}, {"index": "373", "seq1": "Many people start to read Paul's books and can't put them down. They are popular because Paul writes so well.", "seq2": "Paul's books are popular because Paul writes so well.", "label": 0}, {"index": "374", "seq1": "Fred covered his eyes with his hands, because the wind was blowing sand around. He opened them when the wind stopped.", "seq2": "He opened his hands when the wind stopped.", "label": 1}, {"index": "375", "seq1": "The donkey wished a wart on its hind leg would disappear, and it did.", "seq2": "The donkey wished a wart on its hind leg would disappear, and donkey did.", "label": 1}, {"index": "376", "seq1": "At the Loebner competition the judges couldn't figure out which respondents were the chatbots because they were so stupid.", "seq2": "The chatbots were so stupid.", "label": 1}, {"index": "377", "seq1": "This book introduced Shakespeare to Goethe; it was a major influence on his writing.", "seq2": "It was a major influence on Goethe's writing.", "label": 0}, {"index": "378", "seq1": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know who he was, but he looked very unhappy.", "seq2": "I don't know who the guy in uniform was, but he looked very unhappy.", "label": 0}, {"index": "379", "seq1": "John couldn't see the stage with Billy in front of him because he is so short.", "seq2": "Billy is so short.", "label": 1}, {"index": "380", "seq1": "George got free tickets to the play, but he gave them to Eric, because he was not particularly eager to see it.", "seq2": "George was not particularly eager to see it.", "label": 0}, {"index": "381", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "No time today to look at old pictures in Mama's favorite photo album.", "label": 1}, {"index": "382", "seq1": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get it in.", "seq2": "I couldn't get the chewing gum in.", "label": 1}, {"index": "383", "seq1": "The trophy doesn't fit into the brown suitcase because it is too small.", "seq2": "The suitcase is too small.", "label": 0}, {"index": "384", "seq1": "The lawyer asked the witness a question, but he was reluctant to answer it.", "seq2": "The lawyer was reluctant to answer it.", "label": 1}, {"index": "385", "seq1": "Joan made sure to thank Susan for all the help she had recieved.", "seq2": "Joan made sure to thank Susan for all the help Susan had recieved.", "label": 1}, {"index": "386", "seq1": "Mark became absorbed in Blaze, the white horse. He was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so he took upon himself the feeding and care of the animal.", "seq2": "Mark took upon himself the feeding and care of the animal.", "label": 0}, {"index": "387", "seq1": "Tatyana managed two guitars and a bag, and still could point out the Freemans: \"Isn't it nice that they have come, Mama!\"", "seq2": "Isn't it nice that the two guitars and a bag have come, Mama!\"", "label": 1}, {"index": "388", "seq1": "Mark told Pete many lies about himself, which Pete included in his book. He should have been more truthful.", "seq2": "Pete should have been more truthful.", "label": 1}, {"index": "389", "seq1": "Tom threw his schoolbag down to Ray after he reached the bottom of the stairs.", "seq2": "Ray reached the bottom of the stairs.", "label": 0}, {"index": "390", "seq1": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. They were very much in the minority.", "seq2": "The opponents were very much in the minority.", "label": 1}, {"index": "391", "seq1": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, he would have lost.", "seq2": "Adam would have lost.", "label": 0}, {"index": "392", "seq1": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, it was short, so it worked out.", "seq2": "The meeting was short, so it worked out.", "label": 0}, {"index": "393", "seq1": "John couldn't see the stage with Billy in front of him because he is so tall.", "seq2": "John is so tall.", "label": 1}, {"index": "394", "seq1": "All the buttons up the back of Dora's plaid dress were buttoned outside-in. Maude should have thought to button her up; but no, she had left poor little Dora to do the best she could, alone.", "seq2": "She had left poor little Dora to do the best Maude could, alone.", "label": 1}, {"index": "395", "seq1": "I'm sure that my map will show this building; it is very good.", "seq2": "The building is very good.", "label": 1}, {"index": "396", "seq1": "Tom gave Ralph a lift to school so he wouldn't have to walk.", "seq2": "Ralph wouldn't have to walk.", "label": 0}, {"index": "397", "seq1": "Sid explained his theory to Mark but he couldn't understand him.", "seq2": "Sid couldn't understand him.", "label": 1}, {"index": "398", "seq1": "In the middle of the outdoor concert, the rain started falling, but it continued until 10.", "seq2": "The rain continued until 10.", "label": 1}, {"index": "399", "seq1": "Frank was upset with Tom because the toaster he had bought from him didn't work.", "seq2": "The toaster Frank had bought from him didn't work.", "label": 0}, {"index": "400", "seq1": "Dan took the rear seat while Bill claimed the front because his \"Dibs!\" was slow.", "seq2": "Dan took the rear seat while Bill claimed the front because Bill's \"Dibs!\" was slow.", "label": 1}, {"index": "401", "seq1": "The table won't fit through the doorway because it is too wide.", "seq2": "The table is too wide.", "label": 0}, {"index": "402", "seq1": "Jane knocked on the door, and Susan answered it. She invited her to come in.", "seq2": "Susan invited her to come in.", "label": 0}, {"index": "403", "seq1": "The foxes are getting in at night and attacking the chickens. I shall have to guard them.", "seq2": "I shall have to guard The foxes.", "label": 1}, {"index": "404", "seq1": "The city councilmen refused the demonstrators a permit because they advocated violence.", "seq2": "The city councilmen advocated violence.", "label": 1}, {"index": "405", "seq1": "Bob paid for Charlie's college education. He is very generous.", "seq2": "Charlie is very generous.", "label": 1}, {"index": "406", "seq1": "Sara borrowed the book from the library because she needs it for an article she is working on. She writes it when she gets home from work.", "seq2": "She writes the article when she gets home from work.", "label": 0}, {"index": "407", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "No time today to look at old pictures in Alice's favorite photo album.", "label": 0}, {"index": "408", "seq1": "Sam broke both his ankles and he's walking with crutches. But a month or so from now they should be better.", "seq2": "The ankles should be better.", "label": 0}, {"index": "409", "seq1": "The dog chased the cat, which ran up a tree. It waited at the bottom.", "seq2": "The cat waited at the bottom.", "label": 1}, {"index": "410", "seq1": "Jane gave Joan candy because she wasn't hungry.", "seq2": "Joan wasn't hungry.", "label": 1}, {"index": "411", "seq1": "I sallied out for a bit of food, more to pass the time than because I wanted it.", "seq2": "I sallied out for a bit of food, more to pass the time than because I wanted time.", "label": 1}, {"index": "412", "seq1": "The fish ate the worm. It was hungry.", "seq2": "The fish was hungry.", "label": 0}, {"index": "413", "seq1": "As Andrea in the crop duster passed over Susan, she could see the landing gear.", "seq2": "Susan could see the landing gear.", "label": 0}, {"index": "414", "seq1": "Mary tucked her daughter Anne into bed, so that she could sleep.", "seq2": "Mary tucked her daughter Anne into bed, so that Mary's daughter could sleep.", "label": 0}, {"index": "415", "seq1": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires his financial support.", "seq2": "Chester no longer requires his financial support.", "label": 1}, {"index": "416", "seq1": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because it was cooler.", "seq2": "The dog was cooler.", "label": 1}, {"index": "417", "seq1": "I'm sure that my map will show this building; it is very famous.", "seq2": "The map is very famous.", "label": 1}, {"index": "418", "seq1": "We went to the lake, because a shark had been seen at the ocean beach, so it was a dangerous place to swim.", "seq2": "The ocean beach was a dangerous place to swim.", "label": 0}, {"index": "419", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "The captain and all the captain's crew had best stay in the cabin until the work was over.", "label": 0}, {"index": "420", "seq1": "This book introduced Shakespeare to Ovid; it was a major influence on his writing.", "seq2": "It was a major influence on Ovid's writing.", "label": 1}, {"index": "421", "seq1": "Mark told Pete many lies about himself, which Pete included in his book. He should have been more truthful.", "seq2": "Mark should have been more truthful.", "label": 0}, {"index": "422", "seq1": "Jim signaled the barman and gestured toward his empty glass.", "seq2": "Jim signaled the barman and gestured toward The barman's empty glass.", "label": 1}, {"index": "423", "seq1": "Susan knew that Ann's son had been in a car accident, because she told her about it.", "seq2": "Ann told her about it.", "label": 0}, {"index": "424", "seq1": "The table was piled high with food, and on the floor beside it there were crocks, baskets, and a five-quart pail of milk.", "seq2": "Beside the food there were crocks, baskets, and a five-quart pail of milk.", "label": 1}, {"index": "425", "seq1": "Equally swoon-worthy is C.K. Dexter Haven, a pallid young dandy holding a jade-handled walking stick, with a poodle asleep at his feet.", "seq2": "Equally swoon-worthy is C.K. Dexter Haven, a pallid young dandy holding a jade-handled walking stick, with a poodle asleep at the poodle's feet.", "label": 1}, {"index": "426", "seq1": "Fred watched TV while George went out to buy groceries. After an hour he got up.", "seq2": "George got up.", "label": 1}, {"index": "427", "seq1": "Steve follows Fred's example in everything. He admires him hugely.", "seq2": "Steve admires him hugely.", "label": 0}, {"index": "428", "seq1": "Lily spoke to Donna, breaking her concentration.", "seq2": "Lily spoke to Donna, breaking Lily's concentration.", "label": 1}, {"index": "429", "seq1": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her , undressing and climbing back into her berth.", "seq2": "She was careful not to disturb Tatyana , undressing and climbing back into her berth.", "label": 1}, {"index": "430", "seq1": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very ungrateful.", "seq2": "Charlie is very ungrateful.", "label": 0}, {"index": "431", "seq1": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because they are fifteen.", "seq2": "Amy's parents are fifteen.", "label": 1}, {"index": "432", "seq1": "Joan made sure to thank Susan for all the help she had given.", "seq2": "Joan made sure to thank Susan for all the help Joan had given.", "label": 1}, {"index": "433", "seq1": "Tom said \"Check\" to Ralph as he moved his bishop.", "seq2": "Tom said \"Check\" to Ralph as he moved Ralph's bishop.", "label": 1}, {"index": "434", "seq1": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. They were very much in the minority.", "seq2": "The sponsors were very much in the minority.", "label": 0}, {"index": "435", "seq1": "The sculpture rolled off the shelf because it wasn't level.", "seq2": "The sculpture wasn't level.", "label": 1}, {"index": "436", "seq1": "Joe's uncle can still beat him at tennis, even though he is 30 years younger.", "seq2": "Joe's uncle is 30 years younger.", "label": 1}, {"index": "437", "seq1": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know why he was, but he looked very unhappy.", "seq2": "I don't know why Jim was, but he looked very unhappy.", "label": 0}, {"index": "438", "seq1": "Many people start to read Paul's books and can't put them down. They are gripped because Paul writes so well.", "seq2": "People are gripped because Paul writes so well.", "label": 0}, {"index": "439", "seq1": "Sam's drawing was hung just above Tina's and it did look much better with another one above it.", "seq2": "Sam's drawing did look much better with another one above it.", "label": 1}, {"index": "440", "seq1": "We went to the lake, because a shark had been seen at the ocean beach, so it was a dangerous place to swim.", "seq2": "The lake was a dangerous place to swim.", "label": 1}, {"index": "441", "seq1": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. He needed to get him to finish his work, because his work was beautiful.", "seq2": "Mr. Schmidt needed to get him to finish his work, because his work was beautiful.", "label": 1}, {"index": "442", "seq1": "The man lifted the boy onto his bunk bed.", "seq2": "The man lifted the boy onto the boy's bunk bed.", "label": 0}, {"index": "443", "seq1": "So Mark slept. It was daylight when he woke with Warren's hand upon his shoulder.", "seq2": "It was daylight when he woke with Warren's hand upon Mark's shoulder.", "label": 0}, {"index": "444", "seq1": "Frank felt vindicated when his longtime rival Bill revealed that he was the winner of the competition.", "seq2": "Bill was the winner of the competition.", "label": 1}, {"index": "445", "seq1": "The delivery truck zoomed by the school bus because it was going so fast.", "seq2": "The delivery truck was going so fast.", "label": 0}, {"index": "446", "seq1": "Alice looked for her friend Jade in the crowd. Since she always wears a red turban, Alice spotted her quickly.", "seq2": "Since Jade always wears a red turban, Alice spotted her quickly.", "label": 0}, {"index": "447", "seq1": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get it repaired.", "seq2": "Now I have to get The tree repaired.", "label": 1}, {"index": "448", "seq1": "Mary tucked her daughter Anne into bed, so that she could work.", "seq2": "Mary tucked her daughter Anne into bed, so that Mary's daughter could work.", "label": 1}, {"index": "449", "seq1": "Tom said \"Check\" to Ralph as he moved his bishop.", "seq2": "Tom said \"Check\" to Ralph as he moved Tom's bishop.", "label": 0}, {"index": "450", "seq1": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. He was very concerned.", "seq2": "Bob was very concerned.", "label": 1}, {"index": "451", "seq1": "The man couldn't lift his son because he was so heavy.", "seq2": "The man was so heavy.", "label": 1}, {"index": "452", "seq1": "I used an old rag to clean the knife, and then I put it in the drawer.", "seq2": "I put the rag in the drawer.", "label": 1}, {"index": "453", "seq1": "The storekeepers stayed in town to run their stores and lived in the rooms behind them.", "seq2": "The storekeepers stayed in town to run their stores and lived in the rooms behind the stores.", "label": 0}, {"index": "454", "seq1": "Many people start to read Paul's books and can't put them down. They are gripped because Paul writes so well.", "seq2": "Paul's books are gripped because Paul writes so well.", "label": 1}, {"index": "455", "seq1": "Jim yelled at Kevin because he was so upset.", "seq2": "Kevin was so upset.", "label": 1}, {"index": "456", "seq1": "Kirilov ceded the presidency to Shatov because he was less popular.", "seq2": "Shatov was less popular.", "label": 1}, {"index": "457", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "She put the album on a chair without even opening the chair.", "label": 1}, {"index": "458", "seq1": "Sam took French classes from Adam, because he was eager to speak it fluently.", "seq2": "Sam was eager to speak it fluently.", "label": 0}, {"index": "459", "seq1": "The city councilmen refused the demonstrators a permit because they feared violence.", "seq2": "The demonstrators feared violence.", "label": 1}, {"index": "460", "seq1": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very hurt.", "seq2": "Charlie is very hurt.", "label": 1}, {"index": "461", "seq1": "Look! There is a shark swimming right below that duck! It had better get away to safety fast!", "seq2": "The duck had better get away to safety fast!", "label": 0}, {"index": "462", "seq1": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, he would have won.", "seq2": "Bob would have won.", "label": 0}, {"index": "463", "seq1": "The customer walked into the bank and stabbed one of the tellers. He was immediately taken to the police station.", "seq2": "The customer was immediately taken to the police station.", "label": 0}, {"index": "464", "seq1": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under his wing, and quickly molds him into a drug runner.", "seq2": "His father's disciple, Antonio, takes Larry under his wing, and quickly molds Larry into a drug runner.", "label": 1}, {"index": "465", "seq1": "This book introduced Shakespeare to Goethe; it was a fine selection of his writing.", "seq2": "It was a fine selection of Goethe's writing.", "label": 1}, {"index": "466", "seq1": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because it was cooler.", "seq2": "The spot under the tree was cooler.", "label": 0}, {"index": "467", "seq1": "The drain is clogged with hair. It has to be removed.", "seq2": "The hair has to be removed.", "label": 0}, {"index": "468", "seq1": "We went to the lake, because a shark had been seen at the ocean beach, so it was a safer place to swim.", "seq2": "The lake was a safer place to swim.", "label": 0}, {"index": "469", "seq1": "The firemen arrived after the police because they were coming from so far away.", "seq2": "The firemen were coming from so far away.", "label": 0}, {"index": "470", "seq1": "Carol believed that Rebecca regretted that she had stolen the watch.", "seq2": "Carol believed that Rebecca regretted that Carol had stolen the watch.", "label": 1}, {"index": "471", "seq1": "Billy cried because Toby wouldn't accept his toy.", "seq2": "Billy cried because Toby wouldn't accept Billy's toy.", "label": 0}, {"index": "472", "seq1": "Dr. Adams informed Kate that she had retired and presented several options for future treatment.", "seq2": "Kate had retired and presented several options for future treatment.", "label": 1}, {"index": "473", "seq1": "The Wainwrights treated Mr. Crowley like a prince until he made his will in their favor; then they treated him like dirt. Folks said he died just to be rid of their everlasting nagging.", "seq2": "Folks said he died just to be ride of the Wainwrights' everlasting nagging.", "label": 0}, {"index": "474", "seq1": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured it was too hard to pronounce.", "seq2": "Tina was too hard to pronounce.", "label": 1}, {"index": "475", "seq1": "Even before they reached town, they could hear a sound like corn popping. Dora asked what it was, and Dad said it was firecrackers.", "seq2": "Dora asked what the town was.", "label": 1}, {"index": "476", "seq1": "Dr. Adams informed Kate that she had cancer and presented several options for future treatment.", "seq2": "Dr. Adams had cancer and presented several options for future treatment.", "label": 1}, {"index": "477", "seq1": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know who he was, but he looked very unhappy.", "seq2": "I don't know who Jim was, but he looked very unhappy.", "label": 1}, {"index": "478", "seq1": "Joe paid the detective after he delivered the final report on the case.", "seq2": "The detective delivered the final report on the case.", "label": 0}, {"index": "479", "seq1": "Jane knocked on Susan's door but she did not get an answer.", "seq2": "Jane did not get an answer.", "label": 0}, {"index": "480", "seq1": "Tatyana knew that Grandma always enjoyed serving an abundance of food to her guests. Now Tatyana watched as Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled her to the table, lifting her shawl from her shoulders, seating her in the place of honor, and saying simply: \"There's plenty.\"", "seq2": "Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled Tatyana's mother to the table.", "label": 0}, {"index": "481", "seq1": "Susan knows all about Ann's personal problems because she is nosy.", "seq2": "Susan is nosy.", "label": 0}, {"index": "482", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "She put the album on a chair without even opening the album.", "label": 0}, {"index": "483", "seq1": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was gone.", "seq2": "The sun was gone.", "label": 1}, {"index": "484", "seq1": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her, undressing and climbing back into her berth.", "seq2": "She was careful not to disturb her, undressing and climbing back into Tatyana's berth.", "label": 0}, {"index": "485", "seq1": "Jim signaled the barman and gestured toward his empty glass.", "seq2": "Jim signaled the barman and gestured toward Jim's empty glass.", "label": 0}, {"index": "486", "seq1": "The fish ate the worm. It was tasty.", "seq2": "The fish was tasty.", "label": 1}, {"index": "487", "seq1": "The lawyer asked the witness a question, but he was reluctant to repeat it.", "seq2": "The witness was reluctant to repeat it.", "label": 1}, {"index": "488", "seq1": "The cat was lying by the mouse hole waiting for the mouse, but it was too impatient.", "seq2": "The cat was too impatient.", "label": 0}, {"index": "489", "seq1": "Pete envies Martin although he is very successful.", "seq2": "Pete is very successful.", "label": 0}, {"index": "490", "seq1": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get it removed.", "seq2": "Now I have to get The roof removed.", "label": 1}, {"index": "491", "seq1": "George got free tickets to the play, but he gave them to Eric, even though he was particularly eager to see it.", "seq2": "George was particularly eager to see it.", "label": 0}, {"index": "492", "seq1": "The painting in Mark's living room shows an oak tree. It is to the right of a house.", "seq2": "The oak tree is to the right of a house.", "label": 0}, {"index": "493", "seq1": "Look! There is a minnow swimming right below that duck! It had better get away to safety fast!", "seq2": "The minnow had better get away to safety fast!", "label": 0}, {"index": "494", "seq1": "The painting in Mark's living room shows an oak tree. It is to the right of the bookcase.", "seq2": "The oak tree is to the right of the bookcase.", "label": 1}, {"index": "495", "seq1": "I stuck a pin through a carrot. When I pulled the pin out, it had a hole.", "seq2": "The pin had a hole.", "label": 1}, {"index": "496", "seq1": "Susan knows all about Ann's personal problems because she is indiscreet.", "seq2": "Susan is indiscreet.", "label": 1}, {"index": "497", "seq1": "Carol believed that Rebecca suspected that she had stolen the watch.", "seq2": "Carol believed that Rebecca suspected that Rebecca had stolen the watch.", "label": 1}, {"index": "498", "seq1": "Billy cried because Toby wouldn't share his toy.", "seq2": "Billy cried because Toby wouldn't share Billy's toy.", "label": 1}, {"index": "499", "seq1": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with it there all the time.", "seq2": "He had to be the life and soul of a dinner party, with the book there all the time.", "label": 1}, {"index": "500", "seq1": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, he would be gone by this time.", "seq2": "Bob would be gone by this time.", "label": 1}, {"index": "501", "seq1": "The table was piled high with food, and on the floor beside it there were crocks, baskets, and a five-quart pail of milk.", "seq2": "Beside the floor there were crocks, baskets, and a five-quart pail of milk.", "label": 1}, {"index": "502", "seq1": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties he faced in his childhood.", "seq2": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Goodman faced in his childhood.", "label": 1}, {"index": "503", "seq1": "The woman held the girl against her will.", "seq2": "The woman held the girl against the woman's will.", "label": 1}, {"index": "504", "seq1": "Jane knocked on Susan's door, but there was no answer. She was out.", "seq2": "Susan was out.", "label": 0}, {"index": "505", "seq1": "John was doing research in the library when he heard a man humming and whistling. He was very annoying.", "seq2": "The man was very annoying.", "label": 0}, {"index": "506", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "He heard Mark calling for the captain.", "label": 1}, {"index": "507", "seq1": "Bob paid for Charlie's college education. He is very grateful.", "seq2": "Bob is very grateful.", "label": 1}, {"index": "508", "seq1": "In the middle of the outdoor concert, the rain started falling, but it continued until 10.", "seq2": "The concert continued until 10.", "label": 0}, {"index": "509", "seq1": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply not enough of them.", "seq2": "There were simply not enough chairs.", "label": 1}, {"index": "510", "seq1": "Mark became absorbed in Blaze, the white horse. He was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so he took upon himself the feeding and care of the animal.", "seq2": "Blaze was afraid the stable boys at the Burlington Stables struck at him and bullied him.", "label": 1}, {"index": "511", "seq1": "Anne gave birth to a daughter last month. She is a very charming woman.", "seq2": "Anne is a very charming woman.", "label": 0}, {"index": "512", "seq1": "So Mark slept. It was daylight when he woke with Warren's hand upon his shoulder.", "seq2": "It was daylight when he woke with Warren's hand upon Warren's shoulder.", "label": 1}, {"index": "513", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "Mark heard him calling for the captain", "label": 0}, {"index": "514", "seq1": "Stretching her back, the woman smiled at the girl.", "seq2": "Stretching the woman's back, the woman smiled at the girl.", "label": 0}, {"index": "515", "seq1": "Bill passed the half-empty plate to John because he was hungry.", "seq2": "Bill was hungry.", "label": 1}, {"index": "516", "seq1": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured it was too hard to pronounce.", "seq2": "Terpsichore was too hard to pronounce.", "label": 0}, {"index": "517", "seq1": "Beth didn't get angry with Sally, who had cut her off, because she stopped and apologized.", "seq2": "Beth stopped and apologized.", "label": 1}, {"index": "518", "seq1": "The politicians far away in Washington could not know the settlers so they must make rules to regulate them.", "seq2": "The settlers must make rules to regulate them.", "label": 1}, {"index": "519", "seq1": "The trophy doesn't fit into the brown suitcase because it is too large.", "seq2": "The trophy is too large.", "label": 0}, {"index": "520", "seq1": "All the buttons up the back of Dora's plaid dress were buttoned outside-in. Maude should have thought to button her up; but no, she had left poor little Dora to do the best she could, alone.", "seq2": "She had left poor little Dora to do the best Dora could, alone.", "label": 0}, {"index": "521", "seq1": "Alice tried frantically to stop her daughter from barking at the party, leaving us to wonder why she was behaving so strangely.", "seq2": "Alice's daughter was behaving so strangely.", "label": 0}, {"index": "522", "seq1": "The firemen arrived before the police because they were coming from so far away.", "seq2": "The police were coming from so far away.", "label": 0}, {"index": "523", "seq1": "Dan had to stop Bill from toying with the injured bird. He is very compassionate.", "seq2": "Bill is very compassionate.", "label": 1}, {"index": "524", "seq1": "What about the time you cut up tulip bulbs in the hamburgers because you thought they were onions?", "seq2": "You thought hamburgers were onions?", "label": 1}, {"index": "525", "seq1": "Tom gave Ralph a lift to school so he wouldn't have to drive alone.", "seq2": "Ralph wouldn't have to drive alone.", "label": 1}, {"index": "526", "seq1": "Even before they reached town, they could hear a sound like corn popping. Dora asked what it was, and Dad said it was firecrackers.", "seq2": "Dora asked what the corn was.", "label": 1}, {"index": "527", "seq1": "Tom threw his schoolbag down to Ray after he reached the bottom of the stairs.", "seq2": "Tom reached the bottom of the stairs.", "label": 1}, {"index": "528", "seq1": "Anne gave birth to a daughter last month. She is a very charming baby.", "seq2": "Anne is a very charming baby.", "label": 1}, {"index": "529", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "Alice had to hunt for a button.", "label": 0}, {"index": "530", "seq1": "Fred watched TV while George went out to buy groceries. After an hour he got back.", "seq2": "Fred got back.", "label": 1}, {"index": "531", "seq1": "The woman held the girl against her chest.", "seq2": "The woman held the girl against the girl's chest.", "label": 1}, {"index": "532", "seq1": "Sam broke both his ankles and he's walking with crutches. But a month or so from now they should be unnecessary.", "seq2": "The ankles should be unnecessary.", "label": 1}, {"index": "533", "seq1": "Joe has sold his house and bought a new one a few miles away. He will be moving into it on Thursday.", "seq2": "He will be moving into The old house on Thursday.", "label": 1}, {"index": "534", "seq1": "Pam's parents came home and found her having sex with her boyfriend, Paul. They were embarrassed about it.", "seq2": "Pam's parents were embarrassed about it.", "label": 1}, {"index": "535", "seq1": "Sam took French classes from Adam, because he was eager to speak it fluently.", "seq2": "Adam was eager to speak it fluently.", "label": 1}, {"index": "536", "seq1": "John ordered Bill to leave, so an hour later he left.", "seq2": "John left.", "label": 1}, {"index": "537", "seq1": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires his financial support.", "seq2": "He no longer requires Edward's financial support.", "label": 1}, {"index": "538", "seq1": "Beth didn't get angry with Sally, who had cut her off, because she stopped and counted to ten.", "seq2": "Beth stopped and counted to ten.", "label": 0}, {"index": "539", "seq1": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid she lay in the bunk below! Her eyes were closed, but Tatyana doubted if she slept.", "seq2": "How very small and straight and rigid Tatyana lay in the bunk below!", "label": 1}, {"index": "540", "seq1": "The donkey wished a wart on its hind leg would disappear, and it did.", "seq2": "The donkey wished a wart on its hind leg would disappear, and leg did.", "label": 1}, {"index": "541", "seq1": "Since Chester was dependent on Uncle Vernon, he couldn't very well marry without his approval", "seq2": "He couldn't very well marry without Uncle Vernon's approval", "label": 0}, {"index": "542", "seq1": "Madonna fired her trainer because she couldn't stand her boyfriend.", "seq2": "The trainer couldn't stand her boyfriend.", "label": 1}, {"index": "543", "seq1": "Bill passed the gameboy to John because his turn was over.", "seq2": "John's turn was over.", "label": 1}, {"index": "544", "seq1": "The father carried the sleeping boy in his bassinet.", "seq2": "The father carried the sleeping boy in the boy's bassinet.", "label": 0}, {"index": "545", "seq1": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties he faced in his childhood.", "seq2": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Xenophanes faced in his childhood.", "label": 0}, {"index": "546", "seq1": "There is a gap in the wall. You can see the garden behind it.", "seq2": "You can see the garden through the gap.", "label": 1}, {"index": "547", "seq1": "Always before, Larry had helped Dad with his work. But he could not help him now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "seq2": "Larry's boss at the railroad company would not want anyone but him to work in the office.", "label": 1}, {"index": "548", "seq1": "Mary took out her flute and played one of her favorite pieces. She has loved it since she was a child.", "seq2": "She has loved the flute since she was a child.", "label": 1}, {"index": "549", "seq1": "When they had eventually calmed down a bit, and had gotten home, Mr. Farley put the magic pebble in an iron safe. Some day they might want to use it , but really for now, what more could they wish for?", "seq2": "Some day they might want to use the magic pebble.", "label": 0}, {"index": "550", "seq1": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured it was easier to pronounce.", "seq2": "Tina was easier to pronounce.", "label": 0}, {"index": "551", "seq1": "The man lifted the boy onto his shoulders.", "seq2": "The man lifted the boy onto the boy's shoulders.", "label": 1}, {"index": "552", "seq1": "The delivery truck zoomed by the school bus because it was going so slow.", "seq2": "The delivery truck was going so slow.", "label": 1}, {"index": "553", "seq1": "They broadcast an announcement, but a subway came into the station and I couldn't hear it.", "seq2": "I couldn't hear the announcement.", "label": 0}, {"index": "554", "seq1": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford them.", "seq2": "It was bad enough that the children had to be denied so many things because he couldn't afford them.", "label": 0}, {"index": "555", "seq1": "We went to the lake, because a shark had been seen at the ocean beach, so it was a safer place to swim.", "seq2": "The ocean beach was a safer place to swim.", "label": 1}, {"index": "556", "seq1": "Frank was upset with Tom because the toaster he had sold him didn't work.", "seq2": "The toaster Tom had sold him didn't work.", "label": 0}, {"index": "557", "seq1": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, it was delayed, so it worked out.", "seq2": "The train was delayed, so it worked out.", "label": 0}, {"index": "558", "seq1": "There is a gap in the wall. You can see the garden through it.", "seq2": "You can see the garden through the gap.", "label": 0}, {"index": "559", "seq1": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "seq2": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that Bernard had done anything dishonest.", "label": 0}, {"index": "560", "seq1": "Grace was happy to trade me her sweater for my jacket. She thinks it looks great on her.", "seq2": "The jacket looks great on her.", "label": 0}, {"index": "561", "seq1": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send him to steal nuclear material from an army vault.", "seq2": "Lionel plans to use it on Geoffrey and send Dr. Vardi to steal nuclear material from an army vault.", "label": 1}, {"index": "562", "seq1": "Fred watched TV while George went out to buy groceries. After an hour he got up.", "seq2": "Fred got up.", "label": 0}, {"index": "563", "seq1": "I put the heavy book on the table and it broke.", "seq2": "The table broke.", "label": 0}, {"index": "564", "seq1": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply too many of them.", "seq2": "There were simply too many chairs.", "label": 0}, {"index": "565", "seq1": "Sam's drawing was hung just above Tina's and it did look much better with another one above it.", "seq2": "Tina's drawing did look much better with another one above it.", "label": 0}, {"index": "566", "seq1": "Emma's mother had died long ago, and her education had been managed by an excellent woman as governess.", "seq2": "Emma's education had been managed by an excellent woman as governess.", "label": 0}, {"index": "567", "seq1": "John hired Bill to take care of him.", "seq2": "John hired Bill to take care of John.", "label": 0}, {"index": "568", "seq1": "John ordered Bill to leave, so an hour later he left.", "seq2": "Bill left.", "label": 0}, {"index": "569", "seq1": "Susan knows all about Ann's personal problems because she is indiscreet.", "seq2": "Ann is indiscreet.", "label": 0}, {"index": "570", "seq1": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for evidence on the river banks.", "seq2": "Prehistoric humans hunted for evidence on the river banks.", "label": 1}, {"index": "571", "seq1": "The signs over the shops' doors had pictures that indicated what work was done inside. Although more and more people were learning how to read, each artisan still had signs, not wishing to lose a possible patron merely because he happened to be illiterate.", "seq2": "Each artisan still had signs, not wishing to lose a possible patron merely because the artisan happened to be illiterate.", "label": 1}, {"index": "572", "seq1": "The storekeepers stayed in town to run their stores and lived in the rooms behind them.", "seq2": "The storekeepers stayed in town to run their stores and lived in the rooms behind the rooms.", "label": 1}, {"index": "573", "seq1": "Jane knocked on Susan's door, but there was no answer. She was disappointed.", "seq2": "Jane was disappointed.", "label": 0}, {"index": "574", "seq1": "Jane knocked on Susan's door, but there was no answer. She was disappointed.", "seq2": "Susan was disappointed.", "label": 1}, {"index": "575", "seq1": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "seq2": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that the government official had done anything dishonest.", "label": 1}, {"index": "576", "seq1": "The sculpture rolled off the shelf because it wasn't anchored.", "seq2": "The shelf wasn't anchored.", "label": 1}, {"index": "577", "seq1": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. They appeared two years ago.", "seq2": "The fish appeared two years ago.", "label": 0}, {"index": "578", "seq1": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "seq2": "She put the album on a chair without even opening the button.", "label": 1}, {"index": "579", "seq1": "The police arrested all of the gang members. They were trying to run the drug trade in the neighborhood.", "seq2": "The gang members were trying to run the drug trade in the neighborhood.", "label": 0}, {"index": "580", "seq1": "I can't cut that tree down with that axe; it is too small.", "seq2": "The tree is too small.", "label": 1}, {"index": "581", "seq1": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was gone.", "seq2": "The cloud was gone.", "label": 0}, {"index": "582", "seq1": "The path to the lake was blocked, so we couldn't reach it.", "seq2": "We couldn't reach the path.", "label": 1}, {"index": "583", "seq1": "Fred and Alice had very warm down coats, but they were not enough for the cold in Alaska.", "seq2": "Fred and Alice were not enough for the cold in Alaska.", "label": 1}, {"index": "584", "seq1": "Thomson visited Cooper's grave in 1765. At that date he had been travelling for five years.", "seq2": "Thomson had been travelling for five years.", "label": 0}, {"index": "585", "seq1": "The man lifted the boy onto his bunk bed.", "seq2": "The man lifted the boy onto the man's bunk bed.", "label": 1}, {"index": "586", "seq1": "Dan took the rear seat while Bill claimed the front because his \"Dibs!\" was slow.", "seq2": "Dan took the rear seat while Bill claimed the front because Dan's \"Dibs!\" was slow.", "label": 0}, {"index": "587", "seq1": "The woman held the girl against her will.", "seq2": "The woman held the girl against the girl's will.", "label": 0}, {"index": "588", "seq1": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because it got full of coffee.", "seq2": "The pen got full of coffee.", "label": 0}, {"index": "589", "seq1": "This book introduced Shakespeare to Goethe; it was a major influence on his writing.", "seq2": "It was a major influence on Shakespeare's writing.", "label": 1}, {"index": "590", "seq1": "As Ollie carried Tommy up the long winding steps, his legs ached.", "seq2": "Ollie's legs ached.", "label": 0}, {"index": "591", "seq1": "Dr. Adams informed Kate that she had retired and presented several options for future treatment.", "seq2": "Dr. Adams had retired and presented several options for future treatment.", "label": 0}, {"index": "592", "seq1": "I poured water from the bottle into the cup until it was full.", "seq2": "The bottle was full.", "label": 1}, {"index": "593", "seq1": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, it was short, so it worked out.", "seq2": "The train was short, so it worked out.", "label": 1}, {"index": "594", "seq1": "Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like dogs.", "seq2": "The shepherds ended up looking more like dogs.", "label": 1}, {"index": "595", "seq1": "Alice tried frantically to stop her daughter from barking at the party, leaving us to wonder why she was behaving so strangely.", "seq2": "Alice was behaving so strangely.", "label": 1}, {"index": "596", "seq1": "Emma's mother had died long ago, and her place had been taken by an excellent woman as governess.", "seq2": "Emma's place had been taken by an excellent woman as governess.", "label": 1}, {"index": "597", "seq1": "Mary took out her flute and played one of her favorite pieces. She has had it since she was a child.", "seq2": "She has had the piece since she was a child.", "label": 1}, {"index": "598", "seq1": "Tom threw his schoolbag down to Ray after he reached the top of the stairs.", "seq2": "Tom reached the top of the stairs.", "label": 0}, {"index": "599", "seq1": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "seq2": "The captain and all Mr. Singer's crew had best stay in the cabin until the work was over.", "label": 1}, {"index": "600", "seq1": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured it was easier to pronounce.", "seq2": "Terpsichore was easier to pronounce.", "label": 1}, {"index": "601", "seq1": "Fred is the only man still alive who remembers my great-grandfather. He was a remarkable man.", "seq2": "Fred was a remarkable man.", "label": 1}, {"index": "602", "seq1": "Joe paid the detective after he received the final report on the case.", "seq2": "The detective received the final report on the case.", "label": 1}, {"index": "603", "seq1": "Anna did a lot worse than her good friend Lucy on the test because she had studied so hard.", "seq2": "Lucy had studied so hard.", "label": 0}, {"index": "604", "seq1": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. He needed to get him to finish his work, because his work was beautiful.", "seq2": "Mark's work was beautiful.", "label": 1}, {"index": "605", "seq1": "Paul tried to call George on the phone, but he wasn't available.", "seq2": "Paul wasn't available.", "label": 1}, {"index": "606", "seq1": "Lily spoke to Donna, breaking her silence.", "seq2": "Lily spoke to Donna, breaking Donna's silence.", "label": 1}, {"index": "607", "seq1": "The Dakota prairie lay so warm and bright under the shining sun that it did not seem possible that it had ever been swept by the winds and snows of that hard winter.", "seq2": "It did not seem possible that the sun had ever been swept by the winds and snows of that hard winter.", "label": 1}, {"index": "608", "seq1": "The older students were bullying the younger ones, so we punished them.", "seq2": "We punished the younger students.", "label": 1}, {"index": "609", "seq1": "Many people start to read Paul's books and can't put them down. They are popular because Paul writes so well.", "seq2": "People are popular because Paul writes so well.", "label": 1}, {"index": "610", "seq1": "Frank was upset with Tom because the toaster he had bought from him didn't work.", "seq2": "The toaster Tom had bought from him didn't work.", "label": 1}, {"index": "611", "seq1": "There is a pillar between me and the stage, and I can't see it.", "seq2": "I can't see around the pillar.", "label": 1}, {"index": "612", "seq1": "Ann asked Mary what time the library closes, but she had forgotten.", "seq2": "Ann had forgotten.", "label": 1}, {"index": "613", "seq1": "John hired himself out to Bill to take care of him.", "seq2": "John hired himself out to Bill to take care of Bill.", "label": 0}, {"index": "614", "seq1": "Then Dad figured out how much the man owed the store; to that he added the man's board-bill at the cook-shanty. He subtracted that amount from the man's wages, and made out his check", "seq2": "Dad subtracted that amount from the man's wages.", "label": 0}, {"index": "615", "seq1": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. They began two years ago.", "seq2": "The scientists began two years ago.", "label": 0}, {"index": "616", "seq1": "Emma's mother had died long ago, and her education had been managed by an excellent woman as governess.", "seq2": "Emma's mother's education had been managed by an excellent woman as governess.", "label": 1}, {"index": "617", "seq1": "Sid explained his theory to Mark but he couldn't understand him.", "seq2": "Mark couldn't understand him.", "label": 0}, {"index": "618", "seq1": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with it there all the time.", "seq2": "He had to be the life and soul of a dinner party, with the life and soul there all the time.", "label": 1}, {"index": "619", "seq1": "Jim comforted Kevin because he was so upset.", "seq2": "Jim was so upset.", "label": 1}, {"index": "620", "seq1": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave it too small.", "seq2": "Even one thread uncut will leave the hole too small.", "label": 0}, {"index": "621", "seq1": "John hired himself out to Bill to take care of him.", "seq2": "John hired himself out to Bill to take care of John.", "label": 1}, {"index": "622", "seq1": "John couldn't see the stage with Billy in front of him because he is so tall.", "seq2": "Billy is so tall.", "label": 0}, {"index": "623", "seq1": "Patting her back, the woman smiled at the girl.", "seq2": "Patting the girl's back, the woman smiled at the girl.", "label": 0}, {"index": "624", "seq1": "I used an old rag to clean the knife, and then I put it in the trash.", "seq2": "I put the knife in the trash.", "label": 1}, {"index": "625", "seq1": "Since it was raining, I carried the newspaper in my backpack to keep it dry.", "seq2": "I carried the newspaper in my backpack to keep the backpack dry.", "label": 1}, {"index": "626", "seq1": "The sculpture rolled off the shelf because it wasn't level.", "seq2": "The shelf wasn't level.", "label": 0}, {"index": "627", "seq1": "Madonna fired her trainer because she couldn't stand her boyfriend.", "seq2": "Madonna couldn't stand her boyfriend.", "label": 0}, {"index": "628", "seq1": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid she lay in the bunk below! Her eyes were closed, but Tatyana doubted if she slept.", "seq2": "Tatyana doubted if Tatyana slept.", "label": 1}, {"index": "629", "seq1": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because they are fifteen.", "seq2": "Sam and Amy are fifteen.", "label": 0}, {"index": "630", "seq1": "When Tommy dropped his ice cream, Timmy giggled, so father gave him a sympathetic look.", "seq2": "Father gave Timmy a sympathetic look.", "label": 1}, {"index": "631", "seq1": "Mark told Pete many lies about himself, which Pete included in his book. He should have been more skeptical.", "seq2": "Pete should have been more skeptical.", "label": 0}, {"index": "632", "seq1": "Tom said \"Check\" to Ralph as he took his bishop.", "seq2": "Tom said \"Check\" to Ralph as he took Tom's bishop.", "label": 1}, {"index": "633", "seq1": "Emma's mother had died long ago, and her place had been taken by an excellent woman as governess.", "seq2": "Emma's mother's place had been taken by an excellent woman as governess.", "label": 0}, {"index": "634", "seq1": "Although they ran at about the same speed, Sue beat Sally because she had such a bad start.", "seq2": "Sally had such a bad start.", "label": 0}]